zacharyrodwatkins/CrossIDE/Call51/Include/mcs51/EFM8LB1.h
// 16-Bit Register definitions (high,low)
__sfr16 __at (0x8382) DPTR;    // Data pointer
__sfr16 __at (0xCBCA) TMR2RL;  // Timer\Counter 2 reload data
__sfr16 __at (0x9392) TMR3RL;  // Timer\Counter 3 reload register
__sfr16 __at (0xA3A2) TMR4RL;  // Timer\Counter 4 reload register (SFR page 0x10)
__sfr16 __at (0xD3D2) TMR5RL;  // Timer\Counter 5 reload data (SFR page 0x10)
__sfr16 __at (0x8C8A) TMR0;    // Timer\Counter 0 data
__sfr16 __at (0x8D8B) TMR1;    // Timer\Counter 1 data
__sfr16 __at (0xCFCE) TMR2;    // Timer\Counter 2 data
__sfr16 __at (0x9594) TMR3;    // Timer 3 register
__sfr16 __at (0xA5A4) TMR4;    // Timer 4 register (SFR page 0x10)
__sfr16 __at (0xD5D4) TMR5;    // Timer\Counter 5 data (SFR page 0x10)
__sfr16 __at (0x9695) SBRL1;   // UART1 Baud Rate Generator (SFR page 0x20)
__sfr16 __at (0xFAF9) PCA0;    // PCA 0 counter data
__sfr16 __at (0xFCFB) PCA0CP0; // PCA module 0 capture/compare data
__sfr16 __at (0xEAE9) PCA0CP1; // PCA module 1 capture/compare data
__sfr16 __at (0xECEB) PCA0CP2; // PCA module 2 capture/compare data
__sfr16 __at (0xF5F4) PCA0CP3; // PCA module 3 capture/compare data
__sfr16 __at (0x8584) PCA0CP4; // PCA module 4 capture/compare data
__sfr16 __at (0xDEDD) PCA0CP5; // PCA module 5 capture/compare data
__sfr16 __at (0xB6B5) ADC0ASA; // ADC0 Autoscan Start Address (SFR page 0x30)
__sfr16 __at (0xC4C3) ADC0GT;  // ADC0 Greater-Than         
__sfr16 __at (0xBEBD) ADC0;    // ADC0 Data Word               
__sfr16 __at (0xC6C5) ADC0LT;  // ADC0 Less-Than              
__sfr16 __at (0x8584) DAC0;    // DAC0 Data Word (SFR page 0x30)         
__sfr16 __at (0x8A89) DAC1;    // DAC1 Data Word (SFR page 0x30)         
__sfr16 __at (0x8C8B) DAC2;    // DAC2 Data Word (SFR page 0x30)         
__sfr16 __at (0x8E8D) DAC3;    // DAC2 Data Word (SFR page 0x30)         
              
//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC 0xE0 (Accumulator)
__sbit __at (0xE0+0) ACC_0 ; // Accumulator Bit 0
__sbit __at (0xE0+1) ACC_1 ; // Accumulator Bit 0
__sbit __at (0xE0+2) ACC_2 ; // Accumulator Bit 0
__sbit __at (0xE0+3) ACC_3 ; // Accumulator Bit 0
__sbit __at (0xE0+4) ACC_4 ; // Accumulator Bit 0
__sbit __at (0xE0+5) ACC_5 ; // Accumulator Bit 0
__sbit __at (0xE0+6) ACC_6 ; // Accumulator Bit 0
__sbit __at (0xE0+7) ACC_7 ; // Accumulator Bit 0

// ADC0CN0 0xE8 (ADC0 Control 0)
__sbit __at (0xE8+0) TEMPE  ; // Temperature Sensor Enable         
__sbit __at (0xE8+1) ADGN0  ; // Gain Control Bit 0                
__sbit __at (0xE8+2) ADGN1  ; // Gain Control Bit 1                
__sbit __at (0xE8+3) ADWINT ; // Window Compare Interrupt Flag     
__sbit __at (0xE8+4) ADBUSY ; // ADC Busy                          
__sbit __at (0xE8+5) ADINT  ; // Conversion Complete Interrupt Flag
__sbit __at (0xE8+6) IPOEN  ; // Idle Powered-off Enable           
__sbit __at (0xE8+7) ADEN   ; // ADC Enable                        

// B 0xF0 (B Register)
__sbit __at (0xF0+0) B_0 ; // B Register Bit 0
__sbit __at (0xF0+1) B_1 ; // B Register Bit 1
__sbit __at (0xF0+2) B_2 ; // B Register Bit 2
__sbit __at (0xF0+3) B_3 ; // B Register Bit 3
__sbit __at (0xF0+4) B_4 ; // B Register Bit 4
__sbit __at (0xF0+5) B_5 ; // B Register Bit 5
__sbit __at (0xF0+6) B_6 ; // B Register Bit 6
__sbit __at (0xF0+7) B_7 ; // B Register Bit 7

// CLIF0 0xE8 (Configurable Logic Interrupt Flag 0)
__sbit __at (0xE8+0) C0FIF ; // CLU0 Falling Edge Interrupt Flag
__sbit __at (0xE8+1) C0RIF ; // CLU0 Rising Edge Interrupt Flag 
__sbit __at (0xE8+2) C1FIF ; // CLU1 Falling Edge Interrupt Flag
__sbit __at (0xE8+3) C1RIF ; // CLU1 Rising Edge Interrupt Flag 
__sbit __at (0xE8+4) C2FIF ; // CLU2 Falling Edge Interrupt Flag
__sbit __at (0xE8+5) C2RIF ; // CLU2 Rising Edge Interrupt Flag 
__sbit __at (0xE8+6) C3FIF ; // CLU3 Falling Edge Interrupt Flag
__sbit __at (0xE8+7) C3RIF ; // CLU3 Rising Edge Interrupt Flag 

// DACGCF0 0x88 (DAC Global Configuration 0)
__sbit __at (0x88+0) D1SRC0   ; // DAC1 Data Source Bit 0                
__sbit __at (0x88+1) D1SRC1   ; // DAC1 Data Source Bit 1                
__sbit __at (0x88+2) D1AMEN   ; // DAC1 Alternating Mode Enable          
__sbit __at (0x88+3) D01REFSL ; // DAC0 and DAC1 Reference Voltage Select
__sbit __at (0x88+4) D3SRC0   ; // DAC3 Data Source Bit 0                
__sbit __at (0x88+5) D3SRC1   ; // DAC3 Data Source Bit 1                
__sbit __at (0x88+6) D3AMEN   ; // DAC3 Alternating Mode Enable          
__sbit __at (0x88+7) D23REFSL ; // DAC2 and DAC3 Reference Voltage Select

// DACGCF1 0x98 (DAC Global Configuration 1)
__sbit __at (0x98+0) D0UDIS ; // DAC0 Update Disable
__sbit __at (0x98+1) D1UDIS ; // DAC1 Update Disable
__sbit __at (0x98+2) D2UDIS ; // DAC2 Update Disable
__sbit __at (0x98+3) D3UDIS ; // DAC3 Update Disable

// IE 0xA8 (Interrupt Enable)
__sbit __at (0xA8+0) EX0   ; // External Interrupt 0 Enable
__sbit __at (0xA8+1) ET0   ; // Timer 0 Interrupt Enable   
__sbit __at (0xA8+2) EX1   ; // External Interrupt 1 Enable
__sbit __at (0xA8+3) ET1   ; // Timer 1 Interrupt Enable   
__sbit __at (0xA8+4) ES0   ; // UART0 Interrupt Enable     
__sbit __at (0xA8+5) ET2   ; // Timer 2 Interrupt Enable   
__sbit __at (0xA8+6) ESPI0 ; // SPI0 Interrupt Enable      
__sbit __at (0xA8+7) EA    ; // All Interrupts Enable      

// IP 0xB8 (Interrupt Priority)
__sbit __at (0xB8+0) PX0   ; // External Interrupt 0 Priority Control LSB                        
__sbit __at (0xB8+1) PT0   ; // Timer 0 Interrupt Priority Control LSB                           
__sbit __at (0xB8+2) PX1   ; // External Interrupt 1 Priority Control LSB                        
__sbit __at (0xB8+3) PT1   ; // Timer 1 Interrupt Priority Control LSB                           
__sbit __at (0xB8+4) PS0   ; // UART0 Interrupt Priority Control LSB                             
__sbit __at (0xB8+5) PT2   ; // Timer 2 Interrupt Priority Control LSB                           
__sbit __at (0xB8+6) PSPI0 ; // Serial Peripheral Interface (SPI0) Interrupt Priority Control LSB

// P0 0x80 (Port 0 Pin Latch)
__sbit __at (0x80+0) P0_0   ; // Port 0 Bit 0 Latch
__sbit __at (0x80+1) P0_1   ; // Port 0 Bit 1 Latch
__sbit __at (0x80+2) P0_2   ; // Port 0 Bit 2 Latch
__sbit __at (0x80+3) P0_3   ; // Port 0 Bit 3 Latch
__sbit __at (0x80+4) P0_4   ; // Port 0 Bit 4 Latch
__sbit __at (0x80+5) P0_5   ; // Port 0 Bit 5 Latch
__sbit __at (0x80+6) P0_6   ; // Port 0 Bit 6 Latch
__sbit __at (0x80+7) P0_7   ; // Port 0 Bit 7 Latch

// P1 0x90 (Port 1 Pin Latch)
__sbit __at (0x90+0) P1_0 ; // Port 1 Bit 0 Latch
__sbit __at (0x90+1) P1_1 ; // Port 1 Bit 1 Latch
__sbit __at (0x90+2) P1_2 ; // Port 1 Bit 2 Latch
__sbit __at (0x90+3) P1_3 ; // Port 1 Bit 3 Latch
__sbit __at (0x90+4) P1_4 ; // Port 1 Bit 4 Latch
__sbit __at (0x90+5) P1_5 ; // Port 1 Bit 5 Latch
__sbit __at (0x90+6) P1_6 ; // Port 1 Bit 6 Latch
__sbit __at (0x90+7) P1_7 ; // Port 1 Bit 7 Latch

// P2 0xA0 (Port 2 Pin Latch)
__sbit __at (0xA0+0) P2_0 ; // Port 2 Bit 0 Latch
__sbit __at (0xA0+1) P2_1 ; // Port 2 Bit 1 Latch
__sbit __at (0xA0+2) P2_2 ; // Port 2 Bit 2 Latch
__sbit __at (0xA0+3) P2_3 ; // Port 2 Bit 3 Latch
__sbit __at (0xA0+4) P2_4 ; // Port 2 Bit 4 Latch
__sbit __at (0xA0+5) P2_5 ; // Port 2 Bit 5 Latch
__sbit __at (0xA0+6) P2_6 ; // Port 2 Bit 6 Latch

