zacharyrodwatkins/CrossIDE/Call51/Include/mcs51/EFM8LB1.h
// P3 0xB0 (Port 3 Pin Latch)
__sbit __at (0xB0+0) P3_0 ; // Port 3 Bit 0 Latch
__sbit __at (0xB0+1) P3_1 ; // Port 3 Bit 1 Latch
__sbit __at (0xB0+2) P3_2 ; // Port 3 Bit 2 Latch
__sbit __at (0xB0+3) P3_3 ; // Port 3 Bit 3 Latch
__sbit __at (0xB0+4) P3_4 ; // Port 3 Bit 4 Latch
__sbit __at (0xB0+7) P3_7 ; // Port 3 Bit 7 Latch

// PCA0CN0 0xD8 (PCA Control)
__sbit __at (0xD8+0) CCF0 ; // PCA Module 0 Capture/Compare Flag
__sbit __at (0xD8+1) CCF1 ; // PCA Module 1 Capture/Compare Flag
__sbit __at (0xD8+2) CCF2 ; // PCA Module 2 Capture/Compare Flag
__sbit __at (0xD8+3) CCF3 ; // PCA Module 3 Capture/Compare Flag
__sbit __at (0xD8+4) CCF4 ; // PCA Module 4 Capture/Compare Flag
__sbit __at (0xD8+5) CCF5 ; // PCA Module 5 Capture/Compare Flag
__sbit __at (0xD8+6) CR   ; // PCA Counter/Timer Run Control    
__sbit __at (0xD8+7) CF   ; // PCA Counter/Timer Overflow Flag  

// PSW 0xD0 (Program Status Word)
__sbit __at (0xD0+0) PARITY ; // Parity Flag               
__sbit __at (0xD0+1) F1     ; // User Flag 1               
__sbit __at (0xD0+2) OV     ; // Overflow Flag             
__sbit __at (0xD0+3) RS0    ; // Register Bank Select Bit 0
__sbit __at (0xD0+4) RS1    ; // Register Bank Select Bit 1
__sbit __at (0xD0+5) F0     ; // User Flag 0               
__sbit __at (0xD0+6) AC     ; // Auxiliary Carry Flag      
__sbit __at (0xD0+7) CY     ; // Carry Flag                

// SCON0 0x98 (UART0 Serial Port Control)
__sbit __at (0x98+0) RI    ; // Receive Interrupt Flag             
__sbit __at (0x98+1) TI    ; // Transmit Interrupt Flag            
__sbit __at (0x98+2) RB8   ; // Ninth Receive Bit                  
__sbit __at (0x98+3) TB8   ; // Ninth Transmission Bit             
__sbit __at (0x98+4) REN   ; // Receive Enable                     
__sbit __at (0x98+5) CE    ; // Multiprocessor Communication Enable
__sbit __at (0x98+6) SMODE ; // Serial Port 0 Operation Mode       

// SCON1 0xC8 (UART1 Serial Port Control)
__sbit __at (0xC8+0) RI1   ; // Receive Interrupt Flag   
__sbit __at (0xC8+1) TI1   ; // Transmit Interrupt Flag  
__sbit __at (0xC8+2) RBX1  ; // Extra Receive Bit        
__sbit __at (0xC8+3) TBX1  ; // Extra Transmission Bit   
__sbit __at (0xC8+4) REN1  ; // Receive Enable           
__sbit __at (0xC8+5) PERR1 ; // Parity Error Flag        
__sbit __at (0xC8+6) OVR1  ; // Receive FIFO Overrun Flag

// SMB0CN0 0xC0 (SMBus 0 Control)
__sbit __at (0xC0+0) SI      ; // SMBus Interrupt Flag            
__sbit __at (0xC0+1) ACK     ; // SMBus Acknowledge               
__sbit __at (0xC0+2) ARBLOST ; // SMBus Arbitration Lost Indicator
__sbit __at (0xC0+3) ACKRQ   ; // SMBus Acknowledge Request       
__sbit __at (0xC0+4) STO     ; // SMBus Stop Flag                 
__sbit __at (0xC0+5) STA     ; // SMBus Start Flag                
__sbit __at (0xC0+6) TXMODE  ; // SMBus Transmit Mode Indicator   
__sbit __at (0xC0+7) MASTER  ; // SMBus Master/Slave Indicator    

// SPI0CN0 0xF8 (SPI0 Control)
__sbit __at (0xF8+0) SPIEN  ; // SPI0 Enable            
__sbit __at (0xF8+1) TXNF   ; // TX FIFO Not Full       
__sbit __at (0xF8+2) NSSMD0 ; // Slave Select Mode Bit 0
__sbit __at (0xF8+3) NSSMD1 ; // Slave Select Mode Bit 1
__sbit __at (0xF8+4) RXOVRN ; // Receive Overrun Flag   
__sbit __at (0xF8+5) MODF   ; // Mode Fault Flag        
__sbit __at (0xF8+6) WCOL   ; // Write Collision Flag   
__sbit __at (0xF8+7) SPIF   ; // SPI0 Interrupt Flag    

// TCON 0x88 (Timer 0/1 Control)
__sbit __at (0x88+0) IT0 ; // Interrupt 0 Type Select
__sbit __at (0x88+1) IE0 ; // External Interrupt 0   
__sbit __at (0x88+2) IT1 ; // Interrupt 1 Type Select
__sbit __at (0x88+3) IE1 ; // External Interrupt 1   
__sbit __at (0x88+4) TR0 ; // Timer 0 Run Control    
__sbit __at (0x88+5) TF0 ; // Timer 0 Overflow Flag  
__sbit __at (0x88+6) TR1 ; // Timer 1 Run Control    
__sbit __at (0x88+7) TF1 ; // Timer 1 Overflow Flag  

// TMR2CN0 0xC8 (Timer 2 Control 0)
__sbit __at (0xC8+0) T2XCLK0 ; // Timer 2 External Clock Select Bit 0
__sbit __at (0xC8+1) T2XCLK1 ; // Timer 2 External Clock Select Bit 1
__sbit __at (0xC8+2) TR2     ; // Timer 2 Run Control                
__sbit __at (0xC8+3) T2SPLIT ; // Timer 2 Split Mode Enable          
__sbit __at (0xC8+4) TF2CEN  ; // Timer 2 Capture Enable             
__sbit __at (0xC8+5) TF2LEN  ; // Timer 2 Low Byte Interrupt Enable  
__sbit __at (0xC8+6) TF2L    ; // Timer 2 Low Byte Overflow Flag     
__sbit __at (0xC8+7) TF2H    ; // Timer 2 High Byte Overflow Flag    

// TMR4CN0 0x98 (Timer 4 Control 0)
__sbit __at (0x98+0) T4XCLK0 ; // Timer 4 External Clock Select Bit 0
__sbit __at (0x98+1) T4XCLK1 ; // Timer 4 External Clock Select Bit 1
__sbit __at (0x98+2) TR4     ; // Timer 4 Run Control                
__sbit __at (0x98+3) T4SPLIT ; // Timer 4 Split Mode Enable          
__sbit __at (0x98+4) TF4CEN  ; // Timer 4 Capture Enable             
__sbit __at (0x98+5) TF4LEN  ; // Timer 4 Low Byte Interrupt Enable  
__sbit __at (0x98+6) TF4L    ; // Timer 4 Low Byte Overflow Flag     
__sbit __at (0x98+7) TF4H    ; // Timer 4 High Byte Overflow Flag    

// TMR5CN0 0xC0 (Timer 5 Control 0)
__sbit __at (0xC0+0) T5XCLK0 ; // Timer 5 External Clock Select Bit 0
__sbit __at (0xC0+1) T5XCLK1 ; // Timer 5 External Clock Select Bit 1
__sbit __at (0xC0+2) TR5     ; // Timer 5 Run Control                
__sbit __at (0xC0+3) T5SPLIT ; // Timer 5 Split Mode Enable          
__sbit __at (0xC0+4) TF5CEN  ; // Timer 5 Capture Enable             
__sbit __at (0xC0+5) TF5LEN  ; // Timer 5 Low Byte Interrupt Enable  
__sbit __at (0xC0+6) TF5L    ; // Timer 5 Low Byte Overflow Flag     
__sbit __at (0xC0+7) TF5H    ; // Timer 5 High Byte Overflow Flag    

// UART1FCN1 0xD8 (UART1 FIFO Control 1)
__sbit __at (0xD8+0) RIE    ; // Receive Interrupt Enable 
__sbit __at (0xD8+1) RXTO0  ; // Receive Timeout Bit 0    
__sbit __at (0xD8+2) RXTO1  ; // Receive Timeout Bit 1    
__sbit __at (0xD8+3) RFRQ   ; // Receive FIFO Request     
__sbit __at (0xD8+4) TIE    ; // Transmit Interrupt Enable
__sbit __at (0xD8+5) TXHOLD ; // Transmit Hold            
__sbit __at (0xD8+6) TXNF1   ; // TX FIFO Not Full         
__sbit __at (0xD8+7) TFRQ   ; // Transmit FIFO Request    

